tests/ddom-tests-jaxrpc-ri/src/test/resources/webapp/WEB-INF/echo.wsdl

<?xml version="1.0" encoding="UTF-8"?><!--  ~ Copyright 2009-2011 Andreas Veithen  ~  ~ Licensed under the Apache License, Version 2.0 (the "License");  ~ you may not use this file except in compliance with the License.  ~ You may obtain a copy of the License at  ~  ~     http://www.apache.org/licenses/LICENSE-2.0  ~  ~ Unless required by applicable law or agreed to in writing, software  ~ distributed under the License is distributed on an "AS IS" BASIS,  ~ WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  ~ See the License for the specific language governing permissions and  ~ limitations under the License.  --><definitions name="EchoService"             targetNamespace="urn:echo"             xmlns:tns="urn:echo"             xmlns="http://schemas.xmlsoap.org/wsdl/"             xmlns:xsd="http://www.w3.org/2001/XMLSchema"             xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">    <message name="echoRequest">        <part name="arg" type="xsd:string"/>    </message>    <message name="echoResponse">        <part name="result" type="xsd:string"/>    </message>    <portType name="Echo">        <operation name="echo">            <input message="tns:echoRequest"/>            <output message="tns:echoResponse"/>        </operation>    </portType>    <binding name="EchoBinding" type="tns:Echo">        <operation name="echo">            <input>                <soap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" use="encoded" namespace="urn:echo"/>            </input>            <output>                <soap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" use="encoded" namespace="urn:echo"/>            </output>            <soap:operation soapAction=""/>        </operation>        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"/>    </binding>    <service name="EchoService">        <port name="EchoPort" binding="tns:EchoBinding">            <soap:address location="REPLACE_WITH_ACTUAL_URL"/>        </port>    </service></definitions>